#ifndef __SCANNER_H__
#define __SCANNER_H__

#ifdef __cplusplus
 extern "C" {
#endif


/*
****************************************************************************************
* INCLUDES (头文件包含)
****************************************************************************************
*/
#include "stm32f4xx.h"

/*
****************************************************************************************
* TYPEDEFS (数据类型重定义)
****************************************************************************************
*/


typedef struct
{
	uint8_t RevBuf[50];
	uint16_t RevLen;
	uint8_t RevOver;
	uint16_t BufLen;
  uint8_t  type;
}TYPE_SCANNER_U;

extern TYPE_SCANNER_U scannerrev; 



#define TDSaoMa_LEN_MAX 20
extern char TDSaoMa[TDSaoMa_LEN_MAX];
/*
****************************************************************************************
* EXTERNAL VARIABLES (外部变量)
****************************************************************************************
*/


/*
****************************************************************************************
* CONSTANTS (常量)
****************************************************************************************
*/


/*
****************************************************************************************
* MACROS (宏定义)
****************************************************************************************
*/
#define SCANNER_UART UART4

#define SCANNER_UART_IRQn UART4_IRQn
#define SCANNER_UART_IRQHandler UART4_IRQHandler


/*
****************************************************************************************
* PUBLIC FUNCTIONS DECLARE (声明全局函数)
****************************************************************************************
*/

void scanner_232UARTConfig(uint32_t bond);
void scanner_uart_tx_bytes( uint8_t* TxBuffer, uint8_t Length );
void send_scanner_commond(uint8_t *cmd,uint8_t len);
#ifdef __cplusplus
}
#endif

#endif
